import java.util.Arrays;
import java.util.HashSet;

public class ArrayOfWord {
//Создать массив с набором слов (10-20 слов, должны встречаться повторяющиеся). Найти и вывести список уникальных слов,
// из которых состоит массив (дубликаты не считаем). Посчитать, сколько раз встречается каждое слово.

    HashSet<String> hashSetArrayOfWord = new HashSet<>(Arrays.asList(Паскудный Обтаять Плеяда Лежак Расхохотаться Сивучиха Силач Паскудный Фраза Художество Вовремя Выкувырнуть Лежак Оболгать Огранить Опустить Осиный Отморозить Паскудный Художество Разбаловаться));

}
